projectGenerated/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hPolynomial;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       28.01348;
    }
    //thermodynamics
    //{
    //    Tlow            100;
    //    Thigh           10000;
    //    Tcommon         1000;
    //    highCpCoeffs    ( 2.9525407 0.0013968838 -4.9262577e-07 7.8600091e-11 -4.6074978e-15 -923.93753 5.8718221 );
    //    lowCpCoeffs     ( 3.5309628 -0.0001236595 -5.0299339e-07 2.4352768e-09 -1.4087954e-12 -1046.9637 2.9674391 );
    //}
    thermodynamics
    {
        Hf              0;
        Sf              0;
        CpCoeffs<8>     ( 1050.07 -0.37361 0.000933833 -5.9666e-07 1.2934e-10 0 0 0 );
    }
    transport
    {
        As              1.458e-06;
        Ts              110;
        Pr              0.72;
    }
}


// ************************************************************************* //
