projectGenerated/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is a Copy of $FOAM_TUTORIALS/resources/blockMesh/pitzDaily

convertToMeters 0.001;

vertices
...

negY
();

posY
();

posYR
();


blocks
...

boundary
(
    inlet
    {type patch; faces ((32 33 1 0) (33 34 4 1) (34 35 6 4) (35 36 8 6) (36 37 10 8) (37 38 12 10) (38 39 14 12) (39 32 0 14) (32 33 40 40) (33 34 40 40) (34 35 40 40) (35 36 40 40) (36 37 40 40) (37 38 40 40) (38 39 40 40) (39 32 40 40) );}
    outlet
    {type patch; faces ((41 42 43 44) (42 45 46 43) (45 47 48 46) (47 49 50 48) (49 51 52 50) (51 53 54 52) (53 55 56 54) (55 41 44 56) (44 43 57 58) (43 46 59 57) (46 48 60 59) (48 50 61 60) (50 52 62 61) (52 54 63 62) (54 56 64 63) (56 44 58 64) (58 57 65 66) (66 65 67 67) (57 59 68 65) (65 68 67 67) (59 60 69 68) (68 69 67 67) (60 61 70 69) (69 70 67 67) (61 62 71 70) (70 71 67 67) (62 63 72 71) (71 72 67 67) (63 64 73 72) (72 73 67 67) (64 58 66 73) (73 66 67 67) (41 42 24 25) (42 45 26 24) (45 47 27 26) (47 49 28 27) (49 51 29 28) (51 53 30 29) (53 55 31 30) (55 41 25 31) );}
	sides
	{type wall; faces ((0 1 2 3) (1 4 5 2) (4 6 7 5) (6 8 9 7) (8 10 11 9) (10 12 13 11) (12 14 15 13) (14 0 3 15) (3 2 16 17) (2 5 18 16) (5 7 19 18) (7 9 20 19) (9 11 21 20) (11 13 22 21) (13 15 23 22) (15 3 17 23) (17 16 24 25) (16 18 26 24) (18 19 27 26) (19 20 28 27) (20 21 29 28) (21 22 30 29) (22 23 31 30) (23 17 25 31) );}
);

// ************************************************************************* //
